Repository: chaitanyak175/fluxstore
Catalog: lib/l10n/intl_*.arb
Languages: si

source: See All
si: සියල්ල බලන්න

source: Feature Products
si: විශේෂිත නිෂ්පාදන

# bagsCollections
source: Gears Collections
si: බෑග් එකතුව

source: Woman Collections
si: කාන්තා විලාසිතා එකතුව

source: Man Collections
si: පිරිමි විලාසිතා එකතුව

source: Buy Now
si: දැන් මිලදී ගන්න

source: Products
si: නිෂ්පාදන

source: Add To Cart
si: කරත්තයට එකතු කරන්න

source: Description
si: විස්තර

# readReviews
source: Reviews
si: සමාලෝචන කියවන්න

source: Additional Information
si: අමතර විස්තර

source: No Reviews
si: සමාලෝචන නොමැත

# productAdded
source: The product is added
si: නිෂ්පාදන එක් කරන ලදි

source: You might also like
si: ඔබ මේවාටත් කැමති විය හැක

# selectTheSize
source: Select the item
si: ප්‍රමාණය තෝරන්න

source: Select the color
si: වර්ණය තෝරන්න

source: Select the quantity
si: ගණන තෝරන්න

source: Select the file
si: ගොනුව තෝරන්න

source: Size
si: ප්‍රමාණය

source: Color
si: වර්ණය

source: My Cart
si: මගේ කරත්තය

source: Save to Wishlist
si: පැතුම් ලැයිස්තුවට එකතු කරන්න

source: Share
si: බෙදාගන්න

source: Cancel
si: අවලංගු කරන්න

source: Checkout
si: මිලදී ගන්න

source: Clear Cart
si: කරත්තය හිස් කරන්න

source: My Wishlist
si: මගේ පැතුම් ලැයිස්තුව

source: Your bag is empty
si: ඔබගේ බෑගය හිස් ය

# emptyCartSubtitle
source: Looks like you haven’t added any items to the bag yet. Start shopping to fill it in.
si: ඔබ තවමත් බෑගයට කිසිදු අයිතමයක් එකතු කර නැති බව පෙනේ. එය පිරවීම සඳහා සාප්පු සවාරිය අරඹන්න.

source: Start Shopping
si: සාප්පු සවාරිය ආරම්භ කරන්න

source: No favorites yet.
si: තවම ප්‍රියතම කිසිවක් නොමැත.

# emptyWishlistSubtitle
source: Tap any heart next to a product to favorite. We’ll save them for you here!
si: ඕනෑම නිෂ්පාදනයක් ප්‍රියතම ලෙස සලකුණු කිරීමට එය අසල ඇති හදවතට තට්ටු කරන්න. අපි ඒවා ඔබ වෙනුවෙන් මෙහි සුරකිමු!

source: Search for Items
si: අයිතමයන් සොයන්න

source: Shipping
si: බෙදාහැරීම

source: Review
si: පෙරදසුන

source: Payment
si: ගෙවීම

source: First Name
si: මුල් නම

source: Last Name
si: අවසන් නම

source: City
si: නගරය

source: State / Province
si: පළාත / ප්‍රදේශය

source: Zip-code
si: තැපැල් කේතය

source: Country
si: රට

source: Phone number
si: දුරකථන අංකය

source: Email
si: විද්‍යුත් තැපෑල

source: Street Name
si: වීදියේ නම

source: Shipping Method
si: බෙදාහැරීමේ ක්‍රමය

source: Continue to Shipping
si: දිගටම සාප්පු සවාරියේ යෙදෙන්න

# continueToReview
source: Continue to Preview
si: පෙරදසුන් බලන්න

source: Continue to Payment
si: ගෙවීම් කරන්න

source: Go back to address
si: ලිපිනයට ආපසු යන්න

source: Go back to shipping
si: බෙදාහැරීම් වෙත ආපසු යන්න

source: Go back to review
si: පෙරදසුනට ආපසු යන්න

source: Address
si: ලිපිනය

source: Shipping Address
si: බෙදාහැරීම් ලිපිනය

# orderDetail
source: Order Details
si: ඇණවුම් විස්තර

source: Subtotal
si: උප එකතුව

source: Total
si: මුළු එකතුව

source: Payment Methods
si: ගෙවීම් ක්‍රමය

source: Choose your payment method
si: ඔබේ ගෙවීම් ක්‍රමය තෝරන්න

source: Place My Order
si: මගේ ඇණවුම කරන්න

source: It's ordered!
si: එය ඇණවුම් කරන ලදි!

source: Order No
si: ඇණවුම අංකය

source: Show All My Ordered
si: සියලු ඇණවුම් දක්වන්න

source: Back to Shop
si: සාප්පුවට ආපසු යන්න

# firstNameIsRequired
source: The first name field is required
si: පළමු නම අනිවාර්යයි

# lastNameIsRequired
source: The last name field is required
si: අවසාන නම අනිවාර්යයි

# streetIsRequired
source: The street name field is required
si: වීදියේ නම අවශ්‍යයි

# cityIsRequired
source: The city field is required
si: නගරය අවශ්‍යයි

# stateIsRequired
source: The state field is required
si: පළාත අවශ්‍යයි

# countryIsRequired
source: The country field is required
si: රට අවශ්‍යයි

# phoneIsRequired
source: The phone number field is required
si: දුරකථන අංකය අවශ්‍යයි

# emailIsRequired
source: The email field is required
si: විද්‍යුත් තැපෑල අවශ්‍යයි

# zipCodeIsRequired
source: The zip code field is required
si: තැපැල් කේතය අවශ්‍යයි

source: No Orders
si: ඇණවුම් කිසිවක් නොමැත

source: Order Date
si: ඇණවුම් දිනය

source: Status
si: තත්වය

source: Payment Method
si: ගෙවීම් ක්‍රම

source: Order History
si: ඇණවුම් ඉතිහාසය

source: Refund Request
si: ආපසු මුදල් ලබා ගැනීමේ ඉල්ලීම

# recentSearches
source: Recent search results
si: මෑත දී සෙවුම් ප්‍රතිඵල

# recents
source: Recent
si: අලුත්

source: By Price
si: මිල අනුව

source: By Category
si: ප්‍රවර්ගය අනුව

source: No internet connection
si: අන්තර්ජාල සම්බන්ධතාවය නොමැත

source: Connect
si: සම්බන්ධ කරන්න

source: Settings
si: සැකසුම්

source: General Setting
si: සාමාන්‍ය සැකසුම්

# getNotification
source: Get Notifications
si: දැනුම්දීම් ලබාගන්න

# listMessages
source: Notification Messages
si: දැනුම්දීම් පණිවිඩ

# language
source: Languages
si: භාෂාව

source: Dark Theme
si: අඳුරු තේමාව

source: Rate the app
si: යෙදුම ශ්‍රේණිගත කරන්න

source: Logout
si: ඉවත් වන්න

source: Login
si: පුරන්න

source: items
si: අයිතම

source: Cart
si: කරත්තය

source: Shop
si: සාප්පුව

source: Search
si: සොයන්න

source: Blog
si: බ්ලොග්

source: Apply
si: අයදුම් කරන්න

source: Reset
si: නැවත සකසන්න

source: Sign in with email
si: ඊමේල් ලිපිනය සමඟ පිවිසෙන්න

# dontHaveAccount
source: Don't have an account?
si: ගිණුමක් නොමැතිද?

source: Sign up
si: ලියාපදිංචි වන්න

source: Welcome
si: සාදරයෙන් පිළිගනිමු

source: Close
si: වසන්න

source: OR
si: හෝ

# pleaseInput
source: Please fill in the required fields
si: කරුණාකර අවශ්‍ය ක්ෂේත්‍ර පුරවන්න

# searchingAddress
source: Search Address
si: ලිපිනය සෙවීම

source: Out of stock
si: තොග නොමැත

source: Unavailable
si: ලබා ගත නොහැක

source: Category
si: ප්‍රවර්ගය

source: No Product
si: නිෂ්පාදන නැත

# weFoundProducts
source: We found {length} products
si: {length} නිෂ්පාදන සොයාගන්නා ලදී

source: Clear
si: හිස් කරන්න

source: Video
si: වීඩියෝ

# recentView
source: Your Recent View
si: ඔබගේ අලුත් දැක්ම

source: Recently Viewed
si: මෑතදී නැරඹූ අංග

source: In stock
si: තොග ඇත

source: Tracking number is
si: ලුහුබැඳුම් අංකය

source: Availability
si: ලබා ගත හැක

source: Tracking page
si: ලුහුබැඳීම් පිටුව

source: My points
si: මගේ ලකුණු

# youHavePoints
source: You have $point points
si: ඔබට $point ලකුණු ඇත

source: Events
si: සිදුවීම්

source: Date
si: දිනය

source: Point
si: ලකුණු

source: Order notes
si: ඇණවුම් සටහන්

# ratingFirst
source: Please rating before you send your comment
si: කරුණාකර ඔබේ අදහස යැවීමට පෙර ශ්‍රේණිගත කිරීම ලබාදෙන්න

# commentFirst
source: Please write your comment
si: කරුණාකර ඔබේ අදහස ලියන්න

# writeComment
source: Write your comment
si: ඔබගේ අදහසක් ලියන්න

source: Loading...
si: පූරණය වෙමින්...

# productRating
source: Your rating
si: ඔබේ ශ්‍රේණිගත කිරීම

# layout
source: Layouts
si: පිහිටුම

source: Select Address
si: ලිපිනය තෝරන්න

source: Save Address
si: ලිපිනය සුරකින්න

# searchInput
source: Please write input in search field
si: සෙවුම් ක්ෂේත්‍රයේ ඇතුළත් කරන්න

source: Total tax
si: සම්පූර්ණ බදු එකතුව

# invalidSMSCode
source: Invalid SMS Verification code
si: අවලංගු SMS තහවුරු කේතයකි

# sendSMSCode
source: Get code
si: කේතය ලබා ගන්න

# verifySMSCode
source: Verify
si: සහතික කරන්න

source: Show Gallery
si: ගැලරිය පෙන්වන්න

source: Discount
si: වට්ටම

source: Username
si: පරිශීලක නාමය

source: Password
si: මුරපදය

source: Enter your email
si: ඔබගේ ඊමේල් ලිපිනය ඇතුළත් කරන්න

source: Enter your password
si: ඔබගේ මුරපදය ඇතුළත් කරන්න

# iwantToCreateAccount
source: I want to create an account
si: මට ගිණුමක් සෑදීමට අවශ්‍යයි

source: Login to your account
si: ඔබගේ ගිණුමට ඇතුළු වන්න

source: Create an account
si: ගිණුම සාදන්න

source: Coupon code
si: කූපන් කේතය

source: Remove
si: ඉවත් කරන්න

# couponMsgSuccess
source: Congratulations! Coupon code applied successfully
si: සාර්ථකයි! කූපන් කේතය සාර්ථකව අයදුම් කරන ලදි

# saveAddressSuccess
source: Save address successfully
si: ලිපිනය සුරකීම සාර්ථකයි

source: Your note
si: ඔබගේ සටහන

source: Write your note
si: ඔබගේ සටහනක් ලියන්න

# orderSuccessTitle1
source: You've successfully placed the order
si: ඔබ ඇණවුම සාර්ථකව කළා

# orderSuccessMsg1
source: You can check status of your order by using our delivery status feature. You will receive an order confirmation e-mail with details of your order and a link to track its progress.
si: අපගේ බෙදාහැරීමේ තත්ත්‍ව විශේෂාංගය භාවිතයෙන් ඔබට ඔබගේ ඇණවුමේ තත්ත්වය පරීක්ෂා කළ හැක. ඔබගේ ඇණවුමේ විස්තර සහ එහි ප්‍රගතිය නිරීක්ෂණය කිරීමට සබැඳියක් සහිත ඇණවුම තහවුරු කිරීමේ ඊමේල් ලිපියක් ඔබට ලැබෙනු ඇත.

# orderSuccessTitle2
source: Your account
si: ඔබගේ ගිණුම

# orderSuccessMsg2
source: You can log to your account using e-mail and password defined earlier. On your account you can edit your profile data, check history of transactions, edit subscription to newsletter.
si: ඔබගේ ඊමේල් ලිපිනය හා පෙරදී ලබා දුන් මුරපදය භාවිතා කර ඔබගේ ගිණුමට පිවිසෙන්න. ඔබේ ගිණුමෙන් ඔබට ඔබේ ප්‍රොෆයිල විස්තර සංස්කරණය කිරීම, ගනුදෙනු ඉතිහාසය පිරික්සීම, සහ පුවත් පත්‍රිකාවට දායකත්වය සංස්කරණය කිරීමට හැකි ය.

source: Sign In
si: පිවිසෙන්න

source: Sign Up
si: ලියාපදිංචි වන්න

source: Next
si: ඊළඟ

source: Done
si: සම්පූර්ණයි

source: Currencies
si: මුදල්

# sale
source: Sale {percent}%
si: විකුණු {percent}%

# updateUserInfor
source: Update Profile
si: පැතිකඩ යාවත්කාලීන කරන්න

source: Update
si: යාවත්කාලීනය කරන්න

source: About Us
si: අප ගැන

source: Support
si: සහාය

source: Display name
si: ප්‍රදර්ශන නාමය

source: Nice name
si: හොඳ නම

source: English
si: ඉංග්‍රීසි

source: Vietnamese
si: වියට්නාම

source: Arabic
si: අරාබි

source: Spanish
si: ස්පාඤ්ඤ

source: Chinese
si: චීන

source: Japanese
si: ජපන්

# languageSuccess
source: The Language is updated successfully
si: භාෂා සාර්ථකව යාවත්කාලීන කරන ලදි

# agreeWithPrivacy
source: Privacy and Term
si: පෞද්ගලිකත්ව සහ නියමයන්

source: Privacy and Term
si: පෞද්ගලිකත්ව සහ නියමයන්

# iAgree
source: I agree with
si: මම එකඟ වෙමි

source: Categories
si: ප්‍රවර්ග

source: Stores
si: සාප්පු

source: Visit Store
si: සාප්පු වෙත පිවිසෙන්න

source: Sale price
si: විකුණු මිල

source: Regular price
si: සාමාන්‍ය මිල

source: Image Gallery
si: රූප ගැලරිය

source: Adding your image
si: ඔබගේ රූපය එක් කරමින්

source: Post Product
si: නිෂ්පාදනය පිහිටුවන්න

source: Create Product
si: නිෂ්පාදනය නිර්මාණය කිරීම

# waitForLoad
source: Waiting for loading image
si: රූපය පූරණය කිරීම සඳහා රැඳී සිටිමින්

# waitForPost
source: Waiting for posting product
si: නිෂ්පාදනය පළ කිරීම සඳහා රැඳී සිටිමින්

source: Product name
si: නිෂ්පාදන නම

source: Product type
si: නිෂ්පාදන වර්ගය

source: Conversations
si: සංවාද

source: My Products
si: මගේ නිෂ්පාදන

# myProductsEmpty
source: You don't have any products. Try to create one!
si: ඔබගේ නිෂ්පාදන කිසිවක් නොමැත. නිෂ්පාදන එක් කරන්න!

source: Product
si: නිෂ්පාදනය

source: Contact
si: සම්බන්ධතා

source: Current Password
si: වත්මන් මුරපදය

source: New Password
si: නව මුරපදය

# addToCartSucessfully
source: Added to cart successfully
si: ඔබගේ කරත්තයට සාර්ථකව ඇතුළත් කරන ලදී

source: Pull to Load more
si: තව පූරණය කිරීමට අදින්න

# loadFail
source: Load Failed!
si: පූරණය කිරීම අසාර්ථකයි!

source: Release to load more
si: පූරණය කිරීම සඳහා නිදහස් කරන්න

# noData
source: No more Data
si: නැත

source: All
si: සියලු

source: Filter
si: පෙරහන

source: Tags
si: ටැග්

source: Attributes
si: ගුණාංග

source: Reset Password
si: මුරපදය නැවත සකසන්න

source: Reset Your Password
si: ඔබගේ මුරපදය නැවත සකසන්න

# yourUsernameEmail
source: Your username or email
si: ඔබගේ පරිශීලක නාමය හෝ ඊමේල්

source: Get password link
si: මුරපද සබැඳිය ලබාගන්න

# checkConfirmLink
source: Check your email for confirmation link
si: තහවුරු සබැදිය සඳහා ඔබගේ ඊමේල් පණිවිඩ පරීක්ෂා කරන්න

# emptyUsername
source: Username/Email is empty
si: පරිශීලක/ඊමේල් ප්‍රවේශය හිස් විය

source: Romanian
si: රොමේනියානු

source: Turkish
si: තුර්කි

source: Italian
si: ඉතාලි

source: Indonesian
si: ඉන්දුනීසියානු

source: German
si: ජර්මන්

# couponInvalid
source: Your coupon code is invalid
si: ඔබගේ කූපන් කේතය වලංගු නොවේ

source: Featured
si: විශේෂාංග

source: On Sale
si: සේල්

# pleaseCheckInternet
source: Please checking internet connection!
si: කරුණාකර අන්තර්ජාල සබඳතාවය පරික්ෂා කරන්න!

# canNotLaunch
source: Cannot launch this app, make sure your settings on config.dart is correct
si: මෙම යෙදුම දියත් කළ නොහැක, config.dart හි ඔබගේ සැකසීම් නිවැරදි බව සහතික කර ගන්න

source: Message
si: පණිවිඩය

source: Billing Address
si: බිල්පත් ලිපිනය

source: No
si: නැත

source: Yes
si: ඔව්

source: Are you sure?
si: ඔබට විශ්වාසද?

# doYouWantToExitApp
source: Do you want to exit the App
si: ඔබට යෙදුමෙන් ඉවත් වීමට අවශ්‍යද?

# shoppingCartItems
source: Shopping cart, {totalCartQuantity} items
si: අයිතම කරත්තය, අයිතම {totalCartQuantity}

# orderStatusOnHold
source: On hold
si: රඳවා ගත්

# orderStatusPendingPayment
source: Pending Payment
si: පොරොත්තු ගෙවීම

# orderStatusFailed
source: Failed
si: අසාර්ථක

# orderStatusProcessing
source: Processing
si: සක්‍රීයයි

# orderStatusPending
source: Pending
si: තහවුරු කිරීම

# orderStatusCompleted
source: Completed
si: සම්පුර්ණ විය

# orderStatusCancelled
source: Cancelled
si: අවලංගු කිරීම

# orderStatusRefunded
source: Refunded
si: ආපසු ලැබී ඇත

# pleaseFillCode
source: Please fill your code
si: කරුණාකර ඔබගේ කේතය පුරනය කරන්න

# warning
source: Warning: {message}
si: අනතුරු ඇඟවීම: {message}

# nItems
source: {itemCount} items
si: {itemCount} අයිතම

source: Data Empty
si: දත්ත හිස් වේ

# yourAddressExistYourLocal
source: Your address exists in your local
si: ඔබගේ ලිපිනය ඔබගේ ප්‍රාදේශීයයේ පවතී

source: OK
si: හරි

# yourAddressHasBeenSaved
source: The address has been saved to your local storage
si: ඔබගේ ලිපිනය සුරකින ලදී

source: Undo
si: අවලංගු කරන්න

# thisPlatformNotSupportWebview
source: This platform is not support for webview
si: මෙම වේදිකාව වෙබ්දැක්මට සහාය නොදක්වයි

source: No back history item
si: පෙර ඉතිහාස අයිතමයක් නැත

source: No forward history item
si: ඉදිරි ඉතිහාස අයිතමයක් නැත

source: Date Booking
si: දින වෙන් කරවා ගැනීම

source: Duration
si: කාල සීමාව

source: Added Successfully
si: සාර්ථකව එක් කර ඇත

source: Not Found
si: සොයාගත නොහැක

# error
source: Error: {message}
si: දෝෂය: {message}

# goBackHomePage
source: Go back to home page
si: මුල් පිටුවට ආපසු යන්න

# noBlog
source: Opps, the blog seems no longer exist
si: ඔබේ බ්ලොගය තව දුරටත් නොපවතී!

source: Prev
si: පෙර

source: Skip
si: මඟහරින්න

source: Download
si: බාගන්න

source: Download App
si: යෙදුම බාගන්න

# daysAgo
source: {day} days ago
si: දින {day} පෙර

# hoursAgo
source: {hour} hours ago
si: පැය {hour} පෙර

# minutesAgo
source: {minute} minutes ago
si: මිනිත්තු {minute} පෙර

# secondsAgo
source: {second} seconds ago
si: තත්පර {second} පෙර

source: Rate this app
si: මෙම යෙදුම අගයන්න

# rateThisAppDescription
source: If you like this app, please take a little bit of your time to review it ! It really helps us and it shouldn't take you more than one minute.
si: ඔබ මෙම යෙදුමට කැමති නම්, කරුණාකර එය සමාලෝචනය කිරීමට ඔබේ කාලයෙන් ස්වල්පයක් ගන්න ! එය ඇත්තෙන්ම අපට උපකාර වන අතර එයට ඔබේ කාලයෙන් විනාඩියකට වඩා ගත නොවේ.

source: Rate
si: අගය

source: No thanks
si: එපා, ස්තූතියි

source: Maybe Later
si: පසුව

source: Phone
si: දුරකථන

source: Phone Number Verification
si: දුරකථන අංකය සථ්‍යාපනය

# enterSendedCode
source: Enter the code sent to
si: එවන ලද කේතය ඇතුළත් කරන්න

# pleasefillUpAllCellsProperly
source: *Please fill up all the cells properly
si: *කරුණාකර සියලු ක්ෂේත්‍ර නිසි පරිදි පුරවන්න

# didntReceiveCode
source: Didn't receive the code?
si: කේතය ලැබී නොමැතිද?

source: RESEND
si: නැවත යවන්න

# pleaseInputFillAllFields
source: Please fill in all fields
si: සියලු ක්ෂේත්‍ර ඇතුළත් කරන්න

# pleaseAgreeTerms
source: Please agree with our terms
si: කරුණාකර අපේ ප්‍රවේශය සඳහා එකඟ වීමෙන් එයට පිවිසෙන්න

source: Nearby Places
si: යාබද ස්ථාන

source: No Result Found
si: ප්‍රාදේශීය ස්ථාන නොමැත

source: Search Place
si: ස්ථානය සොයන්න

# tapSelectLocation
source: Tap to select this location
si: මෙම ස්ථානය තේරීමට තට්ටු කරන්න

# brazil
source: Portuguese
si: බ්‍රසීල

# backOrder
source: On backorder
si: අනුපිළිවෙල මත

source: French
si: ප්‍රංශ

# loginErrorServiceProvider
source: There is an issue with the app during request the data, please contact admin for fixing the issues: {message}
si: දත්ත ඉල්ලීම අතරතුර යෙදුමේ ගැටලුවක් මතු වී ඇත, කරුණාකර ගැටළු නිරාකරණය සඳහා පරිපාලක සම්බන්ධ කරගන්න: {message}

# loginCanceled
source: The login is cancelled
si: ඇතුළත් වීම අවලංගු කර ඇත

# noPost
source: Opps, this page seems no longer exist!
si: මෙම පිටුව දැනට නොපවතී!

source: Minimum quantity is
si: අවම ප්‍රමාණය

source: You can only purchase
si: ඔබට මිලදී ගත හැක්කේ

source: for this product
si: මෙම නිෂ්පාදනයට

source: Currently we only have
si: දැනට අප සතුව ඇත්තේ

source: of this product
si: මෙම නිෂ්පාදනයේ

source: From
si: සිට

# totalCartValue
source: Total order's value must be at least
si: සම්පූර්ණ ඇණවුම් වටිනාකම අවම වශයෙන් විය යුතු

# hungary
source: Hungarian
si: හන්ගේරියානු

# streetNameApartment
source: Apartment
si: වීදියේ නම/තට්ටු නිවාසය

# streetNameBlock
source: Block
si: වීදි නම

source: By Tag
si: ටැගය මගින්

source: Transaction cancelled
si: ගනුදෙනුව අවලංගු කරන ලදි

source: Tax
si: බදු

source: Sold by
si: අලෙවි කළේ

source: Shop Orders
si: සාප්පු ඇණවුම්

source: Refresh
si: නැවත අලුත් කරන්න

# pointRewardMessage
source: There is the Discount Rule for applying your points to Cart
si: කරත්තයට ඔබේ ලකුණු යෙදීම සඳහා වට්ටම් රීතියක් ඇත

# availablePoints
source: Your available points: {point}
si: ඔබ ලබා ගත් ලකුණු: {point}

source: Select the point
si: ලකුණු තෝරන්න

source: Cart Discount
si: කරත්තයේ වට්ටම

# pleaseSelectAllAttributes
source: Please choose an option for each attribute of the product
si: නිෂ්පාදනයේ සියලු ගුණාංග සඳහා නියමිත විකල්ප තෝරන්න

source: Booking
si: වෙන් කරවා ගැනීම

# bookingError
source: There is something wrong. Please try again later.
si: දෝෂයකි, කරුණාකර පසුව නැවත උත්සාහ කරන්න.

# bookingNow
source: Book Now
si: දැන් වෙන්කරන්න

# bookingSuccess
source: Successfully Booked
si: සාර්ථකව වෙන් කළා

# booked
source: Already booked
si: වෙන් කරන ලදි

source: Waiting for confirmation
si: තහවුරු කිරීම සඳහා රැඳී සිටිමින්

# bookingConfirm
source: Confirmed
si: තහවුරු කරන ලදි

# bookingCancelled
source: Booking Cancel
si: වෙන් කිරීම අවලංගු කිරීම

# bookingUnavailable
source: Booking is unavailable
si: වෙන් කිරීම කළ නොහැක

source: Booking Summary
si: වෙන් කිරීම් සාරාංශය

source: Date End
si: අවසන් දිනය

# dateStart
source: Started Date
si: ආරම්භක දිනය

source: Tickets
si: ප්‍රවේශ පත්‍ර

source: Request Booking
si: අයදුම් කරන්න

source: Extra Services
si: අමතර සේවාවන්

source: Guests
si: අමුත්තන්

source: Hour
si: පැය

source: Features
si: විශේෂාංග

source: Remove from WishList
si: පැතුම් ලැයිස්තුවෙන් ඉවත් කරන්න

source: Map
si: සිතියම

source: Prices
si: මිල

source: Add Listing
si: ලැයිස්තුවක් එකතු කරන්න

source: Booking History
si: වෙන් කිරීම් ඉතිහාසය

source: Vendor Admin
si: විකුණුම්කරු පරිපාලක

source: Russian
si: රුසියානු

# pickADate
source: Pick Date & Time
si: දිනය හා වේලාව තෝරන්න

source: on
si: සිට

source: Your booking detail
si: ඔබගේ වෙන්කිරීම් විස්තර

source: Adults
si: වැඩිහිටි

source: Additional services
si: අමතර සේවාවන්

source: None
si: කිසිවක් නැත

source: This date is not available
si: මෙම දිනය ලබා ගැනීමට නොහැක

source: No slot available
si: කොටස් නොමැත

source: Pay Now
si: දැන් ගෙවන්න

# sold
source: Sold: {numberOfUnitsSold}
si: විකිණූ: {numberOfUnitsSold}

source: Almost sold out
si: මුළුමනින්ම වාගේ විකිණී අවසන්

# endsIn
source: Ends in {timeLeft}
si: අවසානය {timeLeft} වෙත

source: Hebrew
si: හීබෲ

# thailand
source: Thai
si: තායි

source: Hungarian
si: හන්ගේරියන්

source: Vendor Info
si: වෙළඳ තොරතුරු

# netherlands
source: dutch
si: ලංදේසි

# india
source: Hindi
si: හින්දි

source: Use Now
si: දැන් භාවිතා කරන්න

source: Expired
si: කල් ඉකුත් වී ඇත

# validUntilDate
source: Valid til {date}
si: {date} දිනය දක්වා වලංගු ය

source: Expiring in {time}
si: තත්පර {time} කින් අවසාන වේ

source: Fixed Cart Discount
si: ස්ථාපන කරන විට කරත්ත වට්ටම

source: Fixed Product Discount
si: ස්ථාවර නිෂ්පාදන වට්ටම්

source: Coupon has been saved successfully.
si: කුපනය සාර්ථකව ගබඩා කර ඇත.

source: Save For Later
si: පසුවට සුරකින්න

source: refunds
si: ආපසු මුදල් ලබාගැනීම

# continues
source: Continue
si: ඉදිරියට යාම

source: Egypt
si: ඊජිප්තු

source: qty
si: ප්‍රමාණය

source: Item total:
si: අයිතම එක්තුව:

source: Created on:
si: නිර්මාණය කළේ:

source: Order ID:
si: ඇණවුම් අංකය:

source: Gross Sales
si: දළ විකුණුම්

source: Earnings
si: ආදායම්

# allOrders
source: Latest Sales
si: සියලු විකුණුම්

source: Your earnings this month
si: ඔබගේ මාසයේ විකුණුම්

# searchOrderId
source: Search with Order ID...
si: ඇණවුම් අංකය සොයන්න...

source: Your Orders
si: ඔබගේ ඇණවුම්

source: Edit Product Info
si: නිෂ්පාදන තොරතුරු සංස්කරණය කරන්න

source: Can't find this order ID
si: මෙම ඇනවුම් අංකය සොයාගත නොහැක

# showDetails
source: Detail
si: විස්තර

source: or login with
si: හෝ පුරනය වන්න

source: Notifications
si: දැනුම්දීම්

source: Back
si: ආපසු

source: Delivered to
si: බාර දෙන ලද්දේ

source: Order Total
si: ඇණවුම් එකතුව:

source: Add Product
si: නිෂ්පාදනය එකතු කරන්න

source: Take Picture
si: ඡායාරූපය ගැනීම

source: Choose From Gallery
si: ගැලරියෙන් තෝරන්න

source: Choose From Server
si: සර්වරයෙන් තෝරන්න

source: Select Image
si: ඡායාරූපය තෝරන්න

source: ...more
si: ...තව

source: Upload Product
si: නිෂ්පාදනය උඩුගත කරන්න

source: Name
si: නම

source: Stock Quantity
si: තොග ප්‍රමාණය

source: Manage stock
si: තොග කළමනාකරණය කරන්න

source: Short Description
si: කෙටි විස්තරය

source: Update Info
si: විස්තර යාවත්කාලීන කරන්න

source: Stock
si: තොග

source: Pending
si: පොරොත්තු

source: Approve
si: අනුමත

source: Approved
si: අනුමත කරන ලදි

source: rating
si: ශ්‍රේණිගත කිරීම

source: change
si: වෙනස් කිරීම

source: Review Approval
si: සමාලෝචන අනුමත කිරීම

source: Home
si: මුල් පිටුව

source: Reviews
si: සමාලෝචන

source: Update Status
si: තත්ව යාවත්කාලීන කිරීම

# chatListScreen
source: Messages
si: පණිවිඩ ලැයිස්තුව

source: Card number
si: කාඩ් අංකය

source: Expired Date
si: කල් ඉකුත්වීමේ දිනය

# expiredDateHint
source: MM/YY
si: මාස/වසර

source: Card Holder
si: කාඩ්පත් දරන්නා

# mustSelectOneItem
source: Must select 1 item
si: එක් අයිතමයක් තෝරා ගැනීම අනිවාර්යයි

# optionsTotal
source: Options total: {price}
si: එකතු කිරීම් එකතුව: {price}

source: Options
si: විකල්ප

source: Please select required options!
si: අවශ්‍ය විකල්ප තෝරන්න!

source: Location
si: ස්ථානය

source: Send
si: යවන්න

# typeYourMessage
source: Type your message here...
si: ඔබේ පණිවිඩය ඇතුළත් කරන්න...

source: Dashboard
si: ඩෑෂ්බෝඩය

source: Edit:
si: සංස්කරණය:

# editWithoutColon
source: Edit
si: සංස්කරණය

source: This feature does not support the current language
si: මෙම විශේෂාංගය වත්මන් භාෂාවට සහාය නොදක්වයි

source: Brand
si: වෙළඳ නාමය

# reviewPendingApproval
source: Your review has been sent and is waiting for approval!
si: ඔබගේ සමාලෝචනය යවා ඇති අතර අනුමැතිය සඳහා බලා සිටී!

# reviewSent
source: Your review has been sent!
si: ඔබගේ සමාලෝචනය යවන ලදි!

source: Publish
si: ප්‍රකාශනය කරන්න

source: Private
si: පෞද්ගලික

source: Draft
si: සටහන

source: Simple
si: සරල

source: Grouped
si: කණ්ඩායම් කිරීම

source: Variable
si: විචල්‍ය

source: Active
si: සක්‍රිය

source: Uploading
si: උඩුගත

source: Upload file
si: ගොනුව උඩුගත කරන්න

source: Gallery
si: ගැලරිය

source: Files
si: ගොනු

source: Select file cancelled!
si: ගොනුව තෝරා ගැනීම අවලංගු කරන ලදි!

# fileIsTooBig
source: The file is too big. Please choose a smaller file!
si: ගොනුව ඉතා විශාල වේ. කුඩා කරන්න!

source: File upload failed!
si: ගොනුව උඩුගත කළ නොහැක!

source: {total} products
si: {total} නිෂ්පාදන

source: Add a name
si: නම එකතු කිරීම

# addAnAttr
source: Add an attribute
si: විකල්ප එකතු කිරීම

source: Add new
si: නව

source: Select all
si: සියල්ල තෝරන්න

source: Select none
si: කිසිවක් තෝරා නොමැත

source: Visible
si: දර්ශනය

source: Variation
si: ප්‍රභේදය

source: Delete
si: මකන්න

source: Direction
si: දිශාව

source: No listing nearby!
si: අසල ලැයිස්තුගත කිරීමක් නැත!

# emailDoesNotExist
source: The email account that you entered does not exist. Please try again.
si: ඔබ ඇතුළත් කළ ඊමේල් ගිණුම නොපවතී. නැවත උත්සාහ කරන්න.

# errorEmailFormat
source: Please enter a valid email address.
si: කරුණාකර වලංගු ඊමේල් ලිපිනයක් ඇතුළත් කරන්න.
