Repository: chaitanyak175/fluxstore
Catalog: lib/l10n/intl_*.arb
Languages: si

# errorPasswordFormat
source: Please enter a password of at least 8 characters
si: කරුණාකර අක්ෂර 8 වලංගු මුරපදය ඇතුළත් කරන්න

# confirmClearTheCart
source: Are you sure you want to clear the cart?
si: ඔබට කරත්තය හිස් කිරීමට අවශ්‍ය බව විශ්වාසද?

source: Keep
si: තබාගන්න

source: Serbian
si: සර්බියානු

source: Polish
si: පෝලන්ත

source: Persian
si: පර්සියානු

source: Kurdish
si: කුර්දිෂ්

# pleaseSignInBeforeUploading
source: Please sign in to your account before uploading any files.
si: කරුණාකර ගොනු උඩුගත කිරීමට පෙර ඔබේ ගිණුමට ලියාපදිංචි වන්න.

# maximumFileSizeMb
source: Maximum file size: {size} MB
si: උපරිම ගොනුව ප්‍රමාණය: මෙගාබයිට් {size}

source: Login failed!
si: පිවිසුම අසාර්ථකයි!

# loginSuccess
source: Login successfully!
si: පිවිසුම සාර්ථකයි!

# loginInvalid
source: Can not login! Please contact the administrator to check your account/role.
si: පුරනය විය නොහැක! ඔබගේ ගිණුම/කාර්යභාරය පරීක්ෂා කිරීමට කරුණාකර පරිපාලක අමතන්න.

source: Update failed!
si: යාවත්කාලීන කිරීම අසාර්ථකයි!

# updateSuccess
source: Update successfully!
si: යාවත්කාලීන කිරීම සාර්ථකයි!

source: Ukrainian
si: යුක්රේනියානු

source: Bengali
si: බෙංගාලි

source: Chat with Store Owner
si: සාප්පු හිමිකරු සමඟ සංවාද

# chatViaWhatApp
source: Chat via WhatsApp
si: WhatsApp ඔස්සේ සංවාද

# chatViaFacebook
source: Chat via Facebook Messenger
si: Facebook Messenger ඔස්සේ සංවාද

# callTo
source: Make a Call To
si: අමතන්න

# messageTo
source: Send Message To
si: පණිවුඩ යවන්න

# week
source: Week {week}
si: සති {week}

source: Store Settings
si: සාප්පු සැකසුම්

source: Store Logo
si: සාප්පු ලෝගෝ

source: Link
si: සබැඳිය

source: Shop name
si: සාප්පුවේ නම

source: Shop slug
si: වෙළඳ ප්‍රමාණය

source: Shop email
si: සාප්පුවේ ඊමේල් ලිපිනය

source: Shop phone
si: සාප්පුවේ දුරකථන

source: Banner Type
si: බැනර් වර්ගය

source: Store Static Banner
si: ස්ථාන තිරසාර බැනරය

source: Store Slider Banner
si: ස්ථාන ස්ලයිඩර් බැනරය

source: Banner Youtube URL
si: බැනර් Youtube URL

source: Store Mobile Banner
si: ස්ථාන ජංගම බැනරය

source: Banner List Type
si: බැනර් ලැයිස්තු වර්ගය

source: List Banner Type
si: ලැයිස්තු බැනර් වර්ගය

source: List Banner Video
si: ලැයිස්තු බැනරය වීඩියෝ

source: Store List Banner
si: ස්ථාන ලැයිස්තු බැනරය

source: Street
si: වීදිය

source: Street 2
si: වීදි 2

source: Hide Email
si: සබැඳි ඊමේල් සඟවන්න

source: Hide Phone
si: දුරකථන සඟවන්න

source: Hide Address
si: ස්ථානය සඟවන්න

source: Hide Map
si: සැඟවුම අනුරූපනය කරන්න

source: Hide About
si: විස්තර සඟවන්න

source: Hide Policy
si: ප්‍රතිපත්ති සඟවන්න

source: Enter your email or username
si: ඔබගේ ඊමේල් හෝ පරිශීලක නම ඇතුළත් කරන්න

source: Enter your first name
si: ඔබගේ පළමු නම ඇතුළත් කරන්න

source: Enter your last name
si: ඔබගේ අවසන් නම ඇතුළත් කරන්න

source: Enter your phone number
si: ඔබගේ දුරකතන අංකය ඇතුළත් කරන්න

# refundOrderSuccess
source: Request a refund for your order successfully!
si: ඔබගේ ඇණවුම සාර්ථකව අයදුම් කරන ලදි!

source: Add a slug
si: අගය එක් කරන්න

# refundOrderFailed
source: The request for a refund for the order was unsuccessful
si: ඇණවුම සඳහා අයදුම් කිරීම අසාර්ථක විය

source: Confirm
si: තහවුරු කරන්න

# confirmDeleteItem
source: Are you sure you wish to delete this item?
si: මෙම අයිතමය ඉවත් කිරීමට තහවුරු කරන්නද?

source: Mark as read
si: නොකියවූ ලෙස සලකුණු කරන්න

source: Mark as unread
si: නොකියවන්න

source: No file to download.
si: බාගත කිරීමට ගොනුව නොමැත.

# orderStatusShipped
source: Shipped
si: ඇණවුමේ තත්ත්වය

# orderStatusReversed
source: Reversed
si: ආපසු හැරවිය

# orderStatusCanceledReversal
source: Canceled Reversal
si: අවලංගු කරන ලද ආපසු හැරවීම

# orderStatusChargeBack
source: Charge Back
si: ආපසු අය කරන්න

# orderStatusDenied
source: Denied
si: ප්‍රතික්ෂේප කර ඇත

# orderStatusExpired
source: Expired
si: කල් ඉකුත් වී ඇත

# orderStatusProcessed
source: Processed
si: සකසා ඇත

# orderStatusVoided
source: Voided
si: හිස් කර ඇත

source: Delivered
si: භාර දීම

source: Incorrect password
si: වැරදි මුරපදය

source: Delivery Details
si: භාරදීමේ විස්තර

source: Assigned
si: භාර දෙන ලදි

source: Call
si: ඇමතුම

source: Full name
si: සම්පූර්ණ නම

source: Chat
si: සංවාද

source: Update password
si: මුරපදය යාවත්කාලීන කරන්න

source: Customer detail
si: සැපයුම් විස්තර

source: Store Information
si: සැලසුම් තොරතුරු

source: Mark as shipped
si: නැව්ගත කළ ලෙස ලකුණු කරන්න

source: Shipped
si: නැව්ගත කර ඇත

# productCreateReview
source: Your product will show up after review.
si: සමාලෝචනයෙන් පසු ඔබේ නිෂ්පාදනය පෙන්වනු ඇත.

# postSuccessfully
source: Your post has been created succesfully
si: ඔබගේ පෝස්ටුව සාර්ථකව නිර්මාණය කර ඇත.

# postFail
source: Your post is failed to be created
si: ඔබේ පෝස්ටුව නිර්මාණය කිරීමට අසමත් විය

# postTitle
source: Title
si: සිරස්තල

# postContent
source: Content
si: අන්තර්ගතය

# postImageFeature
source: Featured Image
si: විශේෂාංග පින්තුරය

source: Submit Your Post
si: ඔබගේ පෝස්ටුව ඉදිරිපත් කරන්න

source: Post Management
si: පෝස්ටු කළමනාකරණය

# addNewPost
source: Create New Post
si: නව පෝස්ටු එකතු කරන්න

# monthsAgo
source: {month} months ago
si: මාස {month} පෙර

# yearsAgo
source: {year} years ago
si: වසර {year} පෙර

source: We Found Blog(s)
si: අපි බ්ලොග් සොයාගෙන තිබේ

source: Start Exploring
si: ගවේෂණය ආරම්භ කරන්න

# commentSuccessfully
source: Comment successfully, please wait until your comment is approved
si: අදහස් දැක්වීම සාර්ථකයි, කරුණාකර ඔබගේ අදහස අනුමත වන තෙක් රැඳී සිටින්න

# loginToComment
source: Please Login To Comment
si: අදහස එකතු කිරීමට පුරනය වන්න

source: Page View
si: පිටු දැක්ම

source: Add New Blog
si: නව බ්ලොගයක් එක් කරන්න

# momentAgo
source: a moment ago
si: මොහොතකට පෙර

source: Web View
si: වෙබ් දර්ශනය

source: Privacy Policy
si: පෞද්ගලිකත්ව ප්‍රතිපත්තිය

source: Add A New Post
si: නව පෝස්ටුවක් එක් කරන්න

source: Title
si: සිරස්තල

source: Content
si: අන්තර්ගතය

# imageFeature
source: Featured Image
si: විශේෂාංග පින්තුරය

source: Submit
si: ඉදිරිපත් කරන්න

# createNewPostSuccessfully
source: Your post has been successfully created as a draft. Please take a look at your admin site.
si: ඔබේ පළ කිරීම කෙටුම්පතක් ලෙස සාර්ථකව නිර්මාණය කර ඇත. කරුණාකර ඔබගේ පරිපාලක අඩවිය බලන්න.

# emptySearch
source: You haven't searched for items yet. Let's start now - we'll help you.
si: ඔබ තවම අයිතම සෙව්වේ නැත. අපි දැන් පටන් ගනිමු - අපි ඔබට උදව් කරන්නෙමු.

source: Create post
si: පෝස්ටුව සාදන්න

# emptyComment
source: Your comment can not be empty
si: ඔබගේ අදහස හිස් කරන්න

source: Hindi
si: හින්දි

source: korean
si: කොරියානු

source: dutch
si: ලන්දේසි

# relatedLayoutTitle
source: Related blogs
si: සම්බන්ධ බ්ලොග්

# audioDetected
source: Audio item(s) detected. Do you want to add to Audio Player?
si: ශ්‍රව්‍ය අයිතම(ය) අනාවරණය විය. ඔබට Audio Player වෙත එක් කිරීමට අවශ්‍යද?

# dateASC
source: Date ascending
si: දින ආරෝහණ

# dateDESC
source: Date descending
si: දින අවරෝහණ

source: See Order
si: ඇණවුම බලන්න

# openMap
source: Map
si: සිතියම

# allDeliveryOrders
source: All Orders
si: සියලු ඇණවුම්

source: Order Summary
si: ඇණවුම් සාරාංශය

# note
source: Order Note
si: ඇණවුම් සටහන

# searchByName
source: Search with Name...
si: නම මත සොයන්න...

# orderIdWithoutColon
source: Order ID
si: ඇණවුම් හැඳුනුම්පත

# deliveryNotificationError
source: No Data. This order has been removed.
si: දත්ත නොමැත. මෙම ඇණවුම ඉවත් කර ඇත.

# deliveryManagement
source: Delivery
si: භාර දීම

source: Delivery Boy:
si: භාර දුන් පුද්ගලයා:

source: Recurring Totals
si: පුනරාවර්තන එකතුව

source: First Renewal
si: පළමු ප්‍රතිසංස්කරණය

# atLeastThreeCharacters
source: At least 3 characters...
si: අවම වශයෙන් අක්ෂර 3ක්...

source: Popular
si: ප්‍රසිද්ධ

source: Latest Products
si: නවතම නිෂ්පාදන

source: See reviews
si: සමාලෝචන බලන්න

source: Delivery Date
si: භාරදෙන දිනය

# youHaveAssignedToOrder
source: You have assigned to order #{total}
si: ඔබට ඇණවුම #{total} ලැබී ඇත

# distance
source: ~{total} km
si: ~{total} කි.මී

source: Register failed
si: ලියාපදිංචි වී නැත

# registerSuccess
source: Register successfully
si: ලියාපදිංචි වීම සාර්ථකය

source: Invalid Phone Number
si: අවලංගු දුරකථන අංකය

# requestTooMany
source: You have requested too many codes in a short time. Please try again later.
si: ඔබ කෙටි කාලයක් තුළ කේත රැසක් ඉල්ලා ඇත. කරුණාකර පසුව නැවත උත්සාහ කරන්න.

# phoneEmpty
source: Phone is empty
si: දුරකතන අංකය හිස් විය

source: Choose Plan
si: සැලසුමක් තෝරන්න

source: Recommended
si: නිර්දේශිත

source: Paid status
si: ගෙවූ තත්ත්වය

source: Paid
si: ගෙවූ

source: Unpaid
si: ගෙවා නැත

source: Mobile Verification
si: ජංගම දුරකථනය ඔස්සේ තහවුරුව

# enterYourMobile
source: Please enter your mobile number
si: කරුණාකර ඔබේ ජංගම අංකය ඇතුළත් කරන්න

# phoneHintFormat
source: Format: +84123456789
si: ආකෘතිය: +84123456789

# verificationCode
source: Verification code (6 digits)
si: සත්‍යාපන කේතය (අංක 6ක)

# userExists
source: This username/email is not available.
si: මෙම පරිශීලක නාමය/ඊමේල් ලිපිනය නොමැත.

source: Account setup
si: ගිණුම් සැකසුම

# youNotBeAsked
source: You won't be asked next time after the completion
si: මෙය අවසන් වූ පසු ඊළඟ වතාවේදී ඔබෙන් අසනු නොලැබේ.

source: Open now
si: විවෘත සේවාව

# closeNow
source: Closed now
si: වසා ඇත

# storeClosed
source: The store is closed now
si: සාප්පුව දැන් වසා ඇත.

source: Comment
si: විස්තරය

# firstComment
source: Be the first one commenting on this post!
si: මෙම සටහනට අදහස් දක්වන පළමු පුද්ගලයා වන්න!

# greaterDistance
source: >{total} km
si: >{total} කි.මී.

# addToCartMaximum
source: The maximum quantity has been exceeded
si: උපරිම ප්‍රමාණය ඉක්මවා ඇත

source: Play All
si: සියල්ල වාදනය කරන්න

source: Customer note
si: පාරිභෝගිකයාගේ සටහන

source: Stop
si: නවතන්න

# youCanOnlyOrderSingleStore
source: You can only purchase from a single store.
si: ඔබට මිලදී ගත හැක්කේ එක් වෙළඳසැලකින් පමණි.

source: Instantly close
si: ක්ෂණිකව සමීපයි

source: Date wise close
si: දිනය අනුව සමීප

source: Enable vacation mode
si: නිවාඩු මාදිලිය සබල කරන්න

source: Disable purchase
si: මිලදී ගැනීම අක්‍රිය කරන්න

source: Vacation type
si: නිවාඩු වර්ගය

source: Select dates
si: දින තෝරන්න

source: Vacation Message
si: නිවාඩු පණිවිඩය

source: Store vacation
si: සාප්පු නිවාඩුව

# cantPickDateInThePast
source: Date in the past is not allowed
si: අතීතයේ දිනයක් යෙදීමට නොහැක

# endDateCantBeAfterFirstDate
source: Please select a date after first date
si: පළමු දිනයට පසු දිනයක් තෝරන්න

source: On vacation
si: නිවාඩු

source: Refund Requested
si: ආපසු ගෙවීම ඉල්ලා ඇත

source: My Wallet
si: මගේ පසුම්බිය

source: Via wallet
si: පසුම්බිය හරහා

source: Pay by wallet
si: පසුම්බියෙන් ගෙවීම

source: Last Transactions
si: අවසාන ගනුදෙනු

# doNotAnyTransactions
source: You don't have any transactions yet
si: ඔබට තවත් කිසිදු ගනුදෙනුවක් නොමැත

source: Top Up
si: ටොප්-අප්

source: Transfer
si: හුවමාරුව

# historyTransaction
source: History
si: ගනුදෙනු වාර්තාව

source: Top Up product not found
si: ටොප්-අප් නොමැත

source: Transaction Result
si: ගනුදෙනු ප්‍රතිඵල

source: Transfer failed
si: හුවමාරුව අසාර්ථකයි

# errorAmountTransfer
source: Entered amount is greater than current wallet amount. Please try again!
si: ඇතුළත් කළ මුදල පසුම්බියේ පවතින මුදලට වඩා වැඩිය. කරුණාකර නැවත උත්සාහ කරන්න!

source: Back to Wallet
si: පසුම්බියට ආපසු

source: Transfer success
si: හුවමාරුව සාර්ථකයි

source: View recent transactions
si: අලුත්ම ගනුදෙනු බලන්න

source: Amount
si: මුදල

# noteTransfer
source: Note (optional)
si: සටහන (විකල්ප)

# transferConfirm
source: Transfer Confirmation
si: හුවමාරු තහවුරුව

source: Balance
si: ශේෂය

# confirmClearCartWhenTopUp
source: The cart will be cleared when top up.
si: ටොප් අප් කරන විට කරත්තය නිෂ්කාශනය වේ.

# confirmRemoveProductInCart
source: Are you sure you want to remove this product?
si: ඔබට මෙම නිෂ්පාදනය ඉවත් කිරීමට අවශ්‍ය බව විශ්වාසද?

# warningCurrencyMessageForWallet
source: The currently selected currency is not available for the Wallet feature, please change it to {defaultCurrency}
si: දැනට තෝරාගත් මුදල් පසුම්බි විශේෂාංගය සඳහා නොමැත, කරුණාකර එය {defaultCurrency} ලෙස වෙනස් කරන්න.

# transferErrorMessage
source: You can't transfer to this user
si: ඔබට මෙම පරිශීලකයාට මාරු කළ නොහැක

source: Czech
si: චෙක්

source: Choose category
si: ප්‍රවර්ගය තෝරන්න

source: Choose type
si: වර්ගය තෝරන්න

source: External
si: බාහිර

source: Please choose category
si: කරුණාකර ප්‍රවර්ගය තෝරන්න

source: Please add price
si: කරුණාකර මිල එක් කරන්න

# pleaseEnterProductName
source: Please enter the product name
si: කරුණාකර නිෂ්පාදන නමක් ඇතුළත් කරන්න

source: has been deleted
si: මකන ලදි

source: Basic Information
si: මූලික තොරතුරු

# storeEmail
source: Shop Email
si: ගබඩා ලිපිනය

# pointMsgMaximumDiscountPoint
source: Maximum discount point
si: උපරිම වට්ටම් ලකුණ

# pointMsgOverMaximumDiscountPoint
source: You have reach maximum discount point
si: ඔබ උපරිම වට්ටම් ලකුණට ළඟා වී ඇත

# pointMsgSuccess
source: Discount point is applied successfully
si: වට්ටම් ලකුණ සාර්ථකව යොදන ලදි

# pointMsgRemove
source: Discount point is removed
si: වට්ටම් ලකුණ ඉවත් කරන ලදි

# pointMsgEnter
source: Please enter discount point
si: කරුණාකර වට්ටම් ලකුණ ඇතුළත් කරන්න

source: Prepaid
si: පෙර ගෙවුම්

# pointMsgOverTotalBill
source: The total discount value is over the bill total
si: සම්පූර්ණ වට්ටම් වටිනාකම බිල් එකතුවට වඩා වැඩිය

# pointMsgConfigNotFound
source: There is no discount point configuration has been found in server
si: සර්වරයේ වට්ටම් ලක්ෂ්‍ය වින්‍යාස කිරීමක් නොමැත

# pointMsgNotEnough
source: You don't have enough discount point. Your total discount point is
si: ඔබට ප්‍රමාණවත් වට්ටම් ලකුණු නොමැත. ඔබේ සම්පූර්ණ වට්ටම් ලකුණු

# scannerLoginFirst
source: To scan an order, you need to login first
si: ඇණවුම් කිරීම සඳහා පළමුව පිවිසීමට අවශ්‍යයි

# scannerCannotScan
source: This item cannot be scanned
si: මෙම අයිතම ස්කෑන් කළ නොහැක

# scannerOrderAvailable
source: This order is not available for your account
si: මෙම ඇණවුම ඔබගේ ගිණුම සඳහා ලබාගත නොහැක

# storeAddress
source: Shop Address
si: සාමාජිකයාගේ ලිපිනය

source: Store Brand
si: සාමාජික නාමය

source: Store Location
si: සාමාජිකයාගේ ස්ථානය

source: Please select images
si: කරුණාකර පින්තුරයක් තෝරන්න

source: Please select a location
si: කරුණාකර ස්ථානයක් තෝරන්න

# storeBanner
source: Banner
si: බැනර්

source: Finish setup
si: සැකසීම අවසන් කරන්න

source: Is everything set...?
si: සියලු සත්කාරක සටහන් කර ඇත්තේද...?

source: Get Started
si: ආරම්භ කරන්න

source: Online
si: මාර්ගගත

# somethingWrong
source: Something went wrong. Please try again later.
si: දෝෂයක් සිදු විය. කරුණාකර පසුව උත්සාහ කරන්න.

source: Choose Staff
si: සේවකයන් තෝරන්න

source: Morning
si: උදෑසන

source: Afternoon
si: දහවල

source: Evening
si: සවස

source: Expected Delivery Date
si: ලැබීමට අපේක්ෂා කරන දිනය

source: Qty: {total}
si: ප්‍රමාණය: {total}

source: Added
si: එකතු කරන ලදි

source: Re-order
si: නැවත ඇණවුම

# yourOrderHasBeenAdded
source: You order has been added
si: ඔබගේ ඇණවුම එකතු කරන ලදි

source: Swedish
si: ස්වීඩන්

source: Finnish
si: ෆින්ලන්ත

source: Greek
si: ග්‍රීක්

source: Tamil
si: දෙමළ

source: Khmer
si: ක්මර්

# pleaseSelectADate
source: Please select a booking date
si: කරුණාකර වෙන් කිරීම් දිනයක් තෝරන්න

source: All Brands
si: සියලු වෙළඳනාම

source: Kannada
si: කන්නඩ

source: Marathi
si: මරාති

source: History
si: ඉතිහාසය

source: Favorite
si: ප්‍රියතම

source: Orders
si: ඇණවුම්

source: State
si: ප්‍රාන්තය

source: Save
si: සුරකින්න

source: Add to order
si: ඇණවුමට එක් කරන්න

source: Invoice
si: ඉන්වොයිස්

source: Complete
si: සම්පූර්ණයි

source: Cash
si: මුදල්

source: Malay
si: මැලේ

source: Bosnian
si: බොස්නියානු

source: All Products
si: සියලු නිෂ්පාදන

source: Lao
si: ලාඕ

source: Slovak
si: ස්ලෝවැක්

source: Swahili
si: ස්වාහිලි

# posAddressToolTip
source: This address will be saved to your local device. It is NOT the user address.
si: මෙම ලිපිනය ඔබගේ උපාංගයට සුරකිනු ඇත. එය පරිශීලක ලිපිනය නොවේ.

# usernameAndPasswordRequired
source: Username and password are required
si: පරිශීලක නාමය සහ මුරපදය අවශ්‍යයි

# loginToContinue
source: Please login to continue
si: කරුණාකර ස්ථාපනය කිරීම සඳහා පුරනය වන්න

source: Do you want to logout?
si: ඔබට ඉවත් වීමට අවශ්‍යද?

# setAnAddressInSettingPage
source: Please set an address in settings page
si: කරුණාකර සැකසීම් පිටුවේ ලිපිනයක් සකසන්න

source: Received money
si: ලැබූ මුදල

source: Debit
si: හර

source: Transaction detail
si: ගනුදෙනු තොරතුරු

source: Payment successful
si: ගෙවීම සාර්ථකයි

source: Time
si: වේලාව

source: Transaction fee
si: ගනුදෙනු ගාස්තුව

source: Free of charge
si: නොමිලේ

source: Wallet balance
si: පසුම්බියේ ශේෂය

source: More information
si: තව තොරතුරු

source: Wallet name
si: පසුම්බි නාමය

# noteMessage
source: note
si: සටහන

source: Send back
si: ආපසු යවන්න

source: No Printers
si: ප්‍රින්ටර නොමැත

source: Select
si: තෝරන්න

source: Checking...
si: පරික්ෂා කරමින්...

source: Printing...
si: මුද්‍රණය වෙමින්...

# turnOnBle
source: Turn On Bluetooth
si: බ්ලූටූත් කරන්න

source: Date Time
si: දින වේලාව

source: Order Number
si: ඇණවුම් අංකය

source: Print Receipt
si: රිසිට්පත මුද්‍රණය

source: Printer Selection
si: ප්‍රින්ටරය තෝරන්න

# printerNotFound
source: The printer not found
si: ප්‍රින්ටරය හමු වී නැත

source: Item
si: අයිතමය

# bleState
source: Bluetooth Adapter is {state}
si: බ්ලූටූත් ඇඩේප්ටර් {state} වේ

source: Printer
si: මුද්‍රණ යන්ත්‍රය

source: Change Printer
si: මුද්‍රණ යන්ත්‍රය වෙනස් කරන්න

source: Select Printer
si: මුද්‍රණය යන්ත්‍රය තෝරන්න

# bleHasNotBeenEnabled
source: Bluetooth has not been enabled
si: බ්ලූටූත් සක්‍රිය කර නොමැත

source: Attribute already exists
si: ගුණාංගය දැනටමත් පවතී

source: Delete all
si: සියල්ල මකන්න

# createVariants
source: Create all variants
si: සියලු ප්‍රභේද සාදන්න

# anyAttr
source: Any {attribute}
si: කිසිදු {attribute}

source: New variation
si: නව ප්‍රභේදය

source: Your product is under review
si: ඔබගේ නිෂ්පාදනය සමාලෝචනයේ පවතී

source: Order Confirmation
si: ඇණවුම් තහවුරු

# orderConfirmationMsg
source: Are you sure to create the order?
si: ඇණවුමක් සෑදීමට අවශ්‍ය බව ඔබ විශ්වාසද?

# thisProductNotSupport
source: This product is not support
si: මෙම නිෂ්පාදනය සහාය නොදක්වයි

# pleaseSelectAttr
source: Please select at least 1 variation attribute for each active attribute
si: කරුණාකර එක් එක් සක්‍රිය උපලක්ෂණ සඳහා අවම වශයෙන් 1 විචල්‍ය ගුණාංගයක් තෝරන්න

source: Your application is under review.
si: ඔබගේ අයදුම්පත සමාලෝචනයේ පවතී.

source: Chinese (simplified)
si: සරල චීන

source: Chinese (traditional)
si: සාම්ප්‍රදායික චීන

source: Receiver
si: ලබන්නා

source: Burmese
si: බුරුම

source: Albanian
si: ඇල්බේනියානු

# productNeedAtLeastOneVariation
source: Product type variable needs at least one variant
si: නිෂ්පාදන වර්ගයේ විචල්‍යයට අවම වශයෙන් එක් ප්‍රභේදයක් අවශ්‍ය වේ

# productNeedNameAndPrice
source: Product type simple needs the name and regular price
si: නිෂ්පාදන වර්ගයේ නම සහ මිල විස්තරයේ අවශ්‍යයි

source: Sort by
si: අනුව තෝරන්න

source: Date: Latest
si: දිනය: නවතම

source: Date: Oldest
si: දිනය: වඩා පැරණිය

source: Price: Low to High
si: මිල: පහළ සිට ඉහළට

source: Price: High to Low
si: මිල: ඉහළ සිට පහළට

source: Loading link...
si: සබැඳිය පූරණය වෙමින්...

# canNotLoadThisLink
source: The link is currently unavailable on this site.
si: මෙම සබැඳිය පූරණය කළ නොහැක.

source: Image Network
si: පින්තූර ජාලය

source: Paste your image url
si: ඔබගේ පින්තූර URL දමන්න

source: Use this Image
si: මෙම පින්තූරය භාවිතා කරන්න

source: Failed to load image
si: පින්තූරය පූර්ණ කිරීම අසාර්ථකයි

source: Allow
si: ඉඩ දෙන්න

source: Decline
si: ප්‍රතික්ෂේප කරන්න

source: Agree
si: එකඟයි

# notifyLatestOffer
source: Notify latest offers & product availability
si: නව නිෂ්පාදනයන් සඳහා දැනුම් දෙන්න

# weWillSendYouNotification
source: We will send you notifications when new products are available or offers are available. You can always turn it off in the settings.
si: නව නිෂ්පාදන තිබෙන විට හෝ දීමනා තිබෙන විට අපි ඔබට දැනුම්දීම් එවන්නෙමු. ඔබට එය ඕනෑම අවස්ථාවක සැකසීම් තුළින් අක්‍රිය කළ හැක.

# bySignup
source: By signing up, you agree to our
si: ලියාපදිංචි වීමෙන්, ඔබ අපගේ එකඟතාවයට එකඟ වේ

source: Delete Account
si: ගිණුම මකා දමන්න

# areYouSureDeleteAccount
source: Are you sure to delete your account?
si: ඔබ ගිණුම මකා දැමීමට අවශ්‍ය බව සහතිකද?

# deleteAccountMsg
source: Are you sure you want to delete your account? Please read how account deletion will affect.
si: ඔබට ඔබගේ ගිණුම මැකීමට අවශ්‍ය බව විශ්වාසද? කරුණාකර ගිණුම් මකාදැමීම බලපාන ආකාරය කියවන්න.

# accountDeleteDescription
source: Deleting your account removes personal information from our database.
si: ඔබගේ ගිණුම මකා දැමීම අපගේ දත්ත ගබඩාවෙන් පුද්ගලික තොරතුරු ඉවත් කරයි.

# emailDeleteDescription
source: Deleting your account will unsubscribe you from all mailing lists.
si: ඔබගේ ගිණුම මකා දැමීම සියලු තැපැල් ලැයිස්තු වලින් ඔබව දායකත්වයෙන් ඉවත් කරනු ඇත.

# enterCaptcha
source: Enter {captcha} to confirm:
si: තහවුරු කිරීමට {captcha} ඇතුළත් කරන්න:

source: Account
si: ගිණුම

source: Email Subscription
si: ඊමේල් දායකත්වය

source: Confirm Account Deletion
si: ගිණුම මකා දැමීම තහවුරු කිරීමට තීරණය කරන්න

source: Notice
si: නිවේදනය

# needToLoginAgain
source: You need to login again to effect update
si: ඔබට නැවත පුරනය වීමට අවශ්‍ය වේ

# deleteAccountSuccess
source: Account deleted successfully. Your session has been expired.
si: ගිණුම මකා දමන ලදී. ඔබේ සැසිය අවසන් විය.

# pleaseAllowAccessCameraGallery
source: Please allow access to the camera and gallery
si: කරුණාකර කැමරාවට සහ ගැලරියට ප්‍රවේශය සදහා ඉඩ දෙන්න

# failToAssign
source: Failed to assign User
si: පරිශීලක පැවරීම අසාර්ථක විය

source: Go back
si: ආපසු යන්න

source: Privacy & Terms
si: පුද්ගලිකත්ව නියමයන්

source: Results
si: ප්‍රතිඵල

source: Danish
si: ඩෙන්මාර්ක

source: Get notified!
si: දැනුම්දීම් ලබාගන්න!

source: I'm in
si: මම එහි සිටියි

source: Allow Camera access?
si: කැමරා ප්‍රවේශයට ඉඩ දෙන්න?

# weNeedCameraAccessTo
source: We need camera access to scan for QR code or Bar code.
si: QR කේතන හෝ බාර් කේතන සෙවීමට අපට කැමරා ප්‍රවේශයක් අවශ්‍ය වේ.

# noCameraPermissionIsGranted
source: No camera permission is granted. Please grant it in your device's Settings.
si: කැමරා අවසර නොමැත. කරුණාකර ඔබේ උපාංගයේ සැකසුම් තුළ එයට අවසර දෙන්න.

source: Generating link...
si: සබැඳිය උත්පාදනය කරමින්...

source: Invalid Year of Birth
si: උපන් වර්ෂය වලංගු නොවේ

source: Failed to generate link
si: සබැඳිය උත්පාදනය කිරීම අසාර්ථක විය

source: COD Extra Fee
si: COD අමතර ගාස්තුව

source: More from {store}
si: {store} වෙතින් වැඩිපුර

source: Store
si: සාප්පුව

# changedCurrencyTo
source: Changed currency to {currency}
si: {currency} ට මුදල් වෙනස් කිරීම

source: Appearance
si: පෙනුම

source: Light Theme
si: සැහැල්ලු තේමාව

# theFieldIsRequired
source: The {fieldName} field is required
si: {fieldName} ක්ෂේත්‍ර අවශ්‍යයි

# youHaveBeenSaveAddressYourLocal
source: You have saved address to your local file successful !
si: ඔබ ඔබගේ ප්‍රාදේශීය ගොනුවට ලිපිනය සුරකින ලදි!

source: Driver Assigned
si: රියදුරු පවරා ඇත

# enterYourPhone
source: Enter your phone number to get started.
si: ආරම්භ කිරීමට ඔබගේ දුරකථන අංකය ඇතුළත් කරන්න.

source: OTP Verification
si: OTP තහවුරුකිරීම

# weSentAnOTPTo
source: An authentication code has been send to
si: සත්‍යාපන කේතයක් යවා ඇත

# emptyShippingMsg
source: There are no shipping options available. Please ensure that your address has been entered correctly, or contact us if you need any help.
si: නැව්ගත කිරීමේ විකල්ප නොමැත. කරුණාකර ඔබගේ ලිපිනය නිවැරදිව ඇතුළත් කර ඇති බව සහතික කර ගන්න, නැතහොත් ඔබට කිසියම් උදව්වක් අවශ්‍ය නම් අප හා සම්බන්ධ වන්න.

# canNotUpdateInfo
source: Can not update user info.
si: පරිශීලක තොරතුරු යාවත්කාලීන කළ නොහැක.

# canNotCreateUser
source: Can not create the user.
si: පරිශීලකයා නිර්මාණය කළ නොහැක.

# accountIsPendingApproval
source: The account is pending approval.
si: ගිණුම අනුමත වීමට නියමිතයි.

# userNameInCorrect
source: The username or password is incorrect.
si: පරිශීලක නම හෝ මුරපදය වැරදියි.

# canNotSaveOrder
source: Can't save the order to website
si: ඇණවුම වෙබ් අඩවියට සුරැකිය නොහැක

# tagNotExist
source: This tag does not exist
si: මේ ටැගය නොපවතියි

# canNotGetToken
source: Can not get token Info.
si: ටෝකන තොරතුරු ලබා ගත නොහැක

# canNotGetShipping
source: Can not get shipping methods
si: ප්‍රවාහන ක්‍රම ලබා දිය නොහැක
