Repository: chaitanyak175/fluxstore
Catalog: lib/l10n/intl_*.arb
Languages: si

# canNotGetPayments
source: Can not get payment methods
si: ගෙවීම් ක්‍රම ලබා දිය නොහැක

source: Can not create order
si: ඇණවුම සැකසිය නොහැක

source: Title: A to Z
si: මාර්ගය: A සිට Z

source: Title: Z to A
si: මාර්ගය: Z සිට A

source: Popularity
si: ජනප්‍රියත්වය

source: Average Rating
si: මධ්‍ය අගය

# tooManyFaildedLogin
source: Too many failed login attempts. Please try again later.
si: අසාර්ථක පුරනය වීමේ උත්සාහයන් රැසකි. කරුණාකර පසුව නැවත උත්සාහ කරන්න.

source: View on Google Maps
si: ගූගල් සිතියමේ බලන්න

# smsCodeExpired
source: The SMS code has expired. Please re-send the verification code to try again.
si: SMS කේතය අවලංගු වී ඇත. නැවත තහවුරු කිරීමට කරුණාකර කේතය නැවත යවන්න.

# youNeedToLoginCheckout
source: You need to login to checkout
si: පිටවීම සඳහා ඔබ පුරනය විය යුතුය

source: Product Review
si: නිෂ්පාදන සමාලෝචනය

source: Active now
si: දැන් සක්‍රීයයි

# activeLongAgo
source: Active a long time ago
si: බොහෝ කලකට පෙර ක්‍රියාකාරී

# activeFor
source: Active {x}
si: {x} සක්‍රීය වී ඇත

source: Typing...
si: ටයිප් කරමින්...

source: is typing...
si: ටයිප් කරයි...

source: Session Expired
si: සැසිය අවසන් විය

# noConversation
source: No conversation yet
si: සංවාද නැත

# noConversationDescription
source: It will appear once your customers start chatting with you
si: ඔබේ ගනුදෙනුකරුවන් ඔබ සමඟ කතාබස් කිරීමට පටන් ගත් පසු එය දිස්වනු ඇත.

source: Menu order
si: මෙනු පිළිවෙළ

# transactionFailded
source: Transaction failed
si: ගනුදෙනුව අසාර්ථකයි

# doesNotSupportApplePay
source: Apple Pay is not available on this device!
si: මෙම උපාංගයට Apple Pay ලබා ගත නොහැක!

source: {currency} is not supported
si: {currency} සඳහා සහාය නොදක්වයි

source: Retry
si: නැවත උත්සාහ කරන්න

# failedToLoadAppConfig
source: Failed to load application configuration. Please try again or restart your application.
si: යෙදුම් වින්‍යාසය පූරණය කිරීමට අසමත් විය. කරුණාකර නැවත උත්සාහ කරන්න හෝ ඔබේ යෙදුම නැවත ආරම්භ කරන්න.

# yourAccountIsUnderReview
source: Your account is under review. Please contact the administrator if you need any help.
si: ඔබගේ ගිණුම සමාලෝචනය වෙමින් පවතී. ඔබට කිසියම් උදව්වක් අවශ්‍ය නම් කරුණාකර පරිපාලක අමතන්න.

# newAppConfig
source: New content available!
si: නව අන්තර්ගතයන් ලබා ගත හැක!

# seeNewAppConfig
source: Continue to see new content on your app.
si: ඔබගේ යෙදුමේ නව අන්තර්ගතයන් බැලීම දිගටම කරගෙන යන්න.

source: Order tracking
si: ඇණවුම් ලුහුබැඳීම

source: Lock screen and security
si: අගුළු තිරය සහ ආරක්ෂාව

source: Fingerprints, Touch ID
si: ඇඟිලි සලකුණු, ස්පර්ශ හැඳුනුම්පත

source: Enable for Checkout
si: පිටවීම සඳහා සබල කරන්න

source: Enable for Wallet
si: වොලට් සඳහා සක්‍රිය කරන්න

source: Enable for Login
si: පිවිසුම සඳහා සක්‍රිය කරන්න

source: Our bank details
si: අපේ බැංකු විස්තර

source: Bank
si: බැංකුව

source: Account Number
si: ගිණුම් අංකය

source: Sort Code
si: sort කේතය

source: Register as
si: ලියාපදිංචි කිරීම

source: Vendor
si: විකුණුම්කරු

source: Customer
si: පාරිභෝගික

source: Regenerate response
si: ප්‍රතිචාරය පුනර්ජනනය කරන්න

source: Clear conversation
si: සංවාද මකන්න

source: Listening...
si: සවන් දෙමින්...

source: Type a message...
si: පණිවුඩයක් ඇතුළත් කරන්න...

source: Speech not available
si: කතා ලබා ගත නොහැක

source: Tap the mic to talk
si: කතා කිරීම සඳහා මයික් මත ටැප් කරන්න

source: Chat with Bot
si: බොට් සමග සංවාද කරන්න

source: Image generate
si: රූප ජනනය කිරීම

# confirmDelete
source: Are you sure you want to delete this? This action cannot be undone.
si: ඔබට මෙය මැකීමට අවශ්‍ය බව විශ්වාසද? මෙම ක්‍රියාව පසුගමනය කළ නොහැක.

source: Copy
si: පිටපත

source: Copied
si: පිටපත කරන ලදි

source: Show More
si: තවත් පෙන්වන්න

source: Show Less
si: අඩුවෙන් පෙන්වන්න

source: Register As Vendor
si: විකුණුම් කොට්ඨාශයට ලියාපදිංචි කිරීම

source: Select Role
si: භූමිකව තෝරන්න

source: Change language
si: භාෂාව වෙනස් කිරීම

source: Which language do you prefer?
si: ඔබ කැමති භාෂාව කුමක්ද?

# callToVendor
source: Call to Store Owner
si: සාප්පු හිමිකරු අමතන්න

# sendSMStoVendor
source: Send SMS to Store Owner
si: සාප්පු හිමිකරුට එස්.එම්.එස් යවන්න

# paymentMethodIsNotSupported
source: This payment method is not supported
si: මෙම ගෙවීමේ ක්‍රමයට සහය නොදක්වයි

# welcomeUser
source: Welcome {name}
si: ආයුබෝවන් {name}

# minAmountForPayment
source: The minimum amount for using this payment is {currency} {amount}
si: මෙම ගෙවීමේ අවම මුදල {currency} {amount} වේ

# maxAmountForPayment
source: The maximum amount for using this payment is {currency} {amount}
si: මෙම ගෙවීමේ උපරිම මුදල {currency} {amount} වේ

# productOutOfStock
source: This product is out of stock
si: දැනට තොග නොමැති භාණ්ඩයක් ඇත

# quantityProductExceedInStock
source: The current quantity is more than the quantity in stock
si: ප්‍රමාණය පවතින තොග ඉක්මවා යයි

source: Manage API Key
si: API යතුර කළමනාකරණය කරන්න

source: Select Store
si: සාප්පුව තෝරන්න

# convertPoint
source: {priceRate} = {pointRate} Points
si: {priceRate} = {pointRate} ලකුණු

# useMaximumPointDiscount
source: Use maximum {maxPointDiscount} Points for a {maxPriceDiscount} discount on this order!
si: මෙම ඇණවුම සඳහා {maxPriceDiscount} වට්ටමක් සඳහා උපරිම {maxPointDiscount} ලකුණු භාවිතා කරන්න!

# noPermissionForCurrentRole
source: Sorry, this product is not accessible for your current role.
si: සමාවන්න, මෙම නිෂ්පාදනය ඔබගේ වත්මන් භූමිකාව සඳහා ප්‍රවේශ විය නොහැක.

# productExpired
source: Sorry, this product cannot be accessed as it has expired.
si: සමාවන්න, මෙම නිෂ්පාදනය කල් ඉකුත් වී ඇති බැවින් ප්‍රවේශ විය නොහැක.

# noPermissionToViewProduct
source: This product is available for users with specific roles.
si: මෙම නිෂ්පාදනය විශේෂිත භූමිකාවන් සහිත පරිශීලකයින් සඳහා ලබා ගත හැකිය.

# noPermissionToViewProductMsg
source: Please log in with the appropriate credentials to access this product or contact us for more information.
si: කරුණාකර මෙම නිෂ්පාදනයට ප්‍රවේශ වීමට සුදුසු අක්තපත්‍ර සමඟ ලොග් වන්න හෝ වැඩි විස්තර සඳහා අප හා සම්බන්ධ වන්න.

source: Feature not available
si: විශේෂාංගය ලබා ගත නොහැක

# wholesaleRegisterMsg
source: Please reach out to the administrator to approve your registration.
si: ඔබගේ ලියාපදිංචිය අනුමත කිරීමට කරුණාකර පරිපාලක වෙත සම්බන්ධ වන්න.

# notFindResult
source: Sorry, we couldn't find any results.
si: සමාවන්න, අපට ප්‍රතිඵල කිසිවක් සොයාගත නොහැකි විය.

# canNotPlayVideo
source: Sorry, this video cannot be played.
si: මෙම වීඩියෝ දැනට නැරඹිය නොහැක.

source: Become a Vendor
si: අලෙවිකරුවෙක් වෙන්න

# countryIsNotSupported
source: {country} country is not supported
si: {country} රට සහාය නොදක්වයි

# payWithAmount
source: Pay {amount}
si: {amount} ගෙවන්න

source: Name On Card
si: කාඩ්පත් නම

source: Set up
si: සකසන්න

source: This is customer role
si: මෙය පාරිභෝගිකයාගේ භූමිකාවය

source: This is vendor role
si: මෙය අලෙවිකරුවාගේ භූමිකාවය

source: by
si: විසින්

source: PromptPay ID:
si: PromptPay හැඳුනුම්පත:

source: PromptPay Name:
si: PromptPay නම:

source: PromptPay Type:
si: PromptPay වර්ගය:

# noVideoFound
source: Sorry, no videos found.
si: කණගාටුයි, වීඩියෝ සොයාගෙන නොමැත

# mustBeBoughtInGroupsOf
source: must be bought in groups of {number}
si: {number} කණ්ඩායම් වශයෙන් මිලදී ගත යුතුය

# pleaseIncreaseOrDecreaseTheQuantity
source: Please increase or decrease the quantity to continue.
si: කරුණාකර දිගටම කරගෙන යාමට ප්‍රමාණය වැඩි කරන්න හෝ අඩු කරන්න.

source: Search by country name or dial code
si: රටේ නම හෝ ඩයල් කේතය අනුව සොයන්න

source: Opening Hours
si: විවෘතව පවතින පැය

source: Monday
si: සඳුදා

source: Tuesday
si: අඟහරුවාදා

source: Wednesday
si: බදාදා

source: Thursday
si: බ්‍රහස්පතින්දා

source: Friday
si: සිකුරාදා

source: Saturday
si: සෙනසුරාදා

source: Sunday
si: ඉරිදා

source: Closed
si: වසා ඇත

# open24Hours
source: Open 24h
si: පැය 24 විවෘතයි

source: By Appointment Only
si: පෙර වෙන්කිරීම්වලින් පමණි

source: Save QR Code
si: QR කේතය සුරකින්න

# qRCodeMsgSuccess
source: QR code has been saved successfully.
si: QR කේතය සාර්ථකව සුරකින ලදි.

# qRCodeSaveFailure
source: Failed to Save QR Code
si: QR කේතය සුරකීම අසාර්ථකයි

# productNameCanNotEmpty
source: Product name can not be empty
si: නිෂ්පාදන නාමය හිස් විය නොහැක

source: Quantity
si: ප්‍රමාණය

source: Price
si: මිල

source: Add to quote request
si: ඉල්ලුම් කිරීමට එක් කරන්න

source: Information Table
si: විස්තර වගුව
